Autodesk.Revit.UI.AddLinkDialog.Positioning
Since:
2024

Autodesk.Revit.UI.AddLinkDialog.#ctor(System.String,System.String)
Constructs a new instance of a File Open dialog.
filter:
The filter string.  See the remarks for Autodesk.Revit.UI.FileDialog.Filter for details.
initialFolder:
Initial path to browse to when showing the dialog.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input filter string does not meet the minimal requirements for a valid filter string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.AddLinkDialog
This class allows an add-in to prompt the user with the Revit dialog used to navigate to and select an existing
file path, with additional options for linking the selected file in the Revit model (for now the postioning).
Remarks:
The behavior and appearance of this dialog matches the Revit "FileOpen" dialog. This is a general-purpose dialog
for opening a given file type, with the purpose of adding a link of that file to the Revit model.
In addition to the selected file path, this dialog can provide the user with the selected desired positioning
of the link in the Revit model.
Since the positioning options can differ between link types, the corresponding field is an int to increase
reusability.
Since:
2024